{
  "source": "doc/api/jxcore-3rd-party-sqlite3-Debugging.markdown",
  "modules": [
    {
      "textRaw": "Debugging",
      "name": "debugging",
      "desc": "<p>Writing asynchronous functions using the threadpool unfortunately also removes all stack trace information, making debugging very hard since you only see the error message, not which statement caused it. To mitigate this problem, <code>node-sqlite3</code> has a <strong>verbose mode</strong> which captures stack traces when enqueuing queries. To enable this mode, call the <code>sqlite3.verbose()</code>, or call it directly when requiring: <code>var sqlite3 = require(&#39;sqlite3&#39;).verbose()</code>.\n\n</p>\n<p>When you throw an error from a callback passed to any of the database functions, <code>node-sqlite3</code> will append the stack trace information from the original call, like this:\n\n</p>\n<pre><code>Error: SQLITE_RANGE: bind or column index out of range\n--&gt; in Database#run(&#39;CREATE TABLE foo (a, b)&#39;, 3, [Function])\n    at Object.&lt;anonymous&gt; (demo.js:5:4)\n    at Module._compile (module.js:374:26)\n    at Object..js (module.js:380:10)\n    at Module.load (module.js:306:31)\n    at Function._load (module.js:272:10)\n    at Array.&lt;anonymous&gt; (module.js:393:10)\n    at EventEmitter._tickCallback (node.js:108:26)</code></pre>\n<p>Note that you shouldn&#39;t enable the verbose mode in a production setting as the performance penalty for collecting stack traces is quite high.\n\n</p>\n<p>Verbose mode currently does not add stack trace information to error objects emitted on Statement or Database objects.\n\n</p>\n",
      "methods": [
        {
          "textRaw": "Database#on('trace', [callback])",
          "type": "method",
          "name": "Database#on",
          "desc": "<p>The <code>trace</code> event is emitted whenever a query is run. The first and only parameter to the callback is the SQL string that was sent to the database. The event is emitted as soon as the query is <em>executed</em> (e.g. with <code>.run()</code> or <code>.get()</code>). A single statement may be emitted more once. <code>EXPLAIN</code> statements will not trigger an event, so it&#39;s safe to pipe all SQL queries you receive from this event back into the database prefixed with a <code>EXPLAIN QUERY PLAN</code>.\n\n</p>\n<p>If you execute statements from this callback, make sure that you don&#39;t enter an infinite loop!\n\n</p>\n",
          "signatures": [
            {
              "params": [
                {
                  "name": "'trace'"
                },
                {
                  "name": "callback",
                  "optional": true
                }
              ]
            }
          ]
        },
        {
          "textRaw": "Database#on('profile', [callback])",
          "type": "method",
          "name": "Database#on",
          "desc": "<p>The <code>profile</code> event is emitted whenever a query is finished. The first parameter is the SQL string that was sent to the database, the second parameter is the time approximate time it took to run in milliseconds. The event is emitted after the query completed.\n\n</p>\n<p>If you execute statements from this callback, make sure that you don&#39;t enter an infinite loop!\n</p>\n",
          "signatures": [
            {
              "params": [
                {
                  "name": "'profile'"
                },
                {
                  "name": "callback",
                  "optional": true
                }
              ]
            }
          ]
        }
      ],
      "type": "module",
      "displayName": "Debugging"
    }
  ]
}
