{
  "source": "doc/api/jxcore-feature-multithreading.markdown",
  "modules": [
    {
      "textRaw": "Multithreading",
      "name": "multithreading",
      "desc": "<p>Another important feature introduced in JXcore is multithreading.\nIn a single-threaded project <code>setTimeout()</code> and <code>setInterval()</code> methods wait in a separate thread,\nbut the scheduled methods are still executed under the main application thread.\nSince the main thread eventually handles every single task, the application may lost its responsiveness under a load or queued heavy tasks.\nEven if the application works well in a testing environment, it could start slowing down under a massive load (increased number of clients).\n\n</p>\n",
      "modules": [
        {
          "textRaw": "Introduction",
          "name": "introduction",
          "modules": [
            {
              "textRaw": "Subthreads are separated",
              "name": "subthreads_are_separated",
              "desc": "<p>Every thread in JXcore are called a subthread. The subthread is completely separated from the main thread and from the other subthreads,\nbecause they all run in different V8′s contexts/isolates. It means that they cannot share or have common objects, variables etc. directly.\nThus, there is no use for any global variable defined in a main thread – the subthread will not see it.\n\n</p>\n<p>But there is another way – JXcore exposes special thread-safe <a href=\"jxcore-store.html\">Memory Store</a>, which can be shared among threads. See <code>jxcore.store.shared</code> for more information.\n\n</p>\n<p>Apart from that, there are also two other ways for subthread to communicate with the main thread:\n\n</p>\n<ol>\n<li>sending a message – <a href=\"jxcore-thread.html#jxcore_thread_process_sendtomain_param\"><code>process.sendToMain()</code></a>,</li>\n<li>returning the result from the task, since this is the regular method.</li>\n</ol>\n",
              "type": "module",
              "displayName": "Subthreads are separated"
            },
            {
              "textRaw": "Defaults",
              "name": "defaults",
              "desc": "<p>JXcore uses the following defaults for subthreads for multithreaded applications:\n\n</p>\n<ol>\n<li>minimum amount is set to 2. This is also the default value.</li>\n<li>maximum amount is set to 63.</li>\n</ol>\n<p>You can also control the number of subthreads and there are two ways you can do this, but that depends how you run the application.\n\n</p>\n<p>If you launch te code with mt/mt-keep command line parameter, you can set the threads count by applying a number after the colon, like:\n\n</p>\n<pre><code>&gt; jx mt:4 hello.js</code></pre>\n<p>Otherwise you can use <a href=\"jxcore-tasks.html#jxcore_tasks_tasks_setthreadcount_value\"><code>tasks.setThreadCount()</code></a> method.\nSee also <a href=\"jxcore-feature-multithreading.html#jxcore_feature_multithreading_how_to_run_multithreaded_code\">How to run multithreaded code?</a> for more information.\n\n</p>\n",
              "type": "module",
              "displayName": "Defaults"
            },
            {
              "textRaw": "Memory management",
              "name": "memory_management",
              "desc": "<p>Since node is based on V8 engine, it also inherits it’s defaults and limitations.\n\n</p>\n<p>Currently, the default V8 memory limit is 512 MB on 32-bit systems and 1 GB on 64-bit systems.\nAccording to the documentation, this can be raised to a maximum of 1 GB and 1.7 GB respectively.\n\n</p>\n<p>But one of the most important factors about running multithreaded tasks in JXcore is the fact that the main thread\nas well as every subthread uses its own V8 heap space, so the V8 memory limits applies to each of them separately!\nFor example, an application which runs on four threads can hold up to 5 x 1.7 GB of memory (1 for the main thread and 4 for the subthreads)!\n\n</p>\n<p>And when there are no currently active tasks, JXcore subthreads force an automatic V8 heap cleanup – each of them separately on its own!\n\n</p>\n<p>Moreover, the queue mechanism for the subthreads uses separate memory blocks than V8 engine.\nIt means that it \boccupies a different place in the memory, hence the queues do not fall under the limitations mentioned above.\n\n</p>\n",
              "type": "module",
              "displayName": "Memory management"
            },
            {
              "textRaw": "Native C++ Node.JS modules",
              "name": "native_c++_node.js_modules",
              "desc": "<p>See <a href=\"https://github.com/Nubisa/jxdocs/tree/master/native\">native</a>.\n\n</p>\n",
              "type": "module",
              "displayName": "Native C++ Node.JS modules"
            }
          ],
          "type": "module",
          "displayName": "Introduction"
        },
        {
          "textRaw": "How to run multithreaded code?",
          "name": "how_to_run_multithreaded_code?",
          "desc": "<p>There are two ways of executing your JavaScript code in multiple threads with JXcore.\n\n</p>\n",
          "modules": [
            {
              "textRaw": "Multithreading from the command line",
              "name": "multithreading_from_the_command_line",
              "desc": "<p>The first and the easiest one is just to use <code>mt</code> or <code>mt-keep</code> option in the command-line for jx:\n\n</p>\n<pre><code>&gt; jx mt-keep:4 easy1.js</code></pre>\n<p>This topic is fully described here: <a href=\"jxcore-command-mt.html\">mt / mt-keep</a>\n\n</p>\n",
              "type": "module",
              "displayName": "Multithreading from the command line"
            },
            {
              "textRaw": "Multithreaded Javascript Tasks",
              "name": "multithreaded_javascript_tasks",
              "desc": "<p>The second one is by using <code>jxcore.tasks</code> object. It requires you to implement all the multithreaded logic by yourself.\nThen you run the application without any jx’s options:\n\n</p>\n<pre><code>&gt; jx tasks_way.js</code></pre>\n<p>The main difference between those two methods is, that with mt/mt-keep approach you have to do absolutely nothing\nto run the application multithreaded. However, the same code is running separately for each thread\nand you don’t really have any control over changing the thread’s job, once the application started.\n\n</p>\n<p>With the second (the “tasks”) approach it’s all about adding jobs to the queue of the thread pool.\nTasks start and finish while you can add more tasks in the runtime.\nIn this model you always have the main thread and the subthreads.\nYou can also get notified, when all task are completed.\nSee the API for reference.\n\n</p>\n<p>This topic is fully described here: <a href=\"jxcore-tasks.html\">Tasks</a>\n</p>\n",
              "type": "module",
              "displayName": "Multithreaded Javascript Tasks"
            }
          ],
          "type": "module",
          "displayName": "How to run multithreaded code?"
        }
      ],
      "type": "module",
      "displayName": "Multithreading"
    }
  ]
}
